app/controllers/authors_controller.rb

  def show
    @author = Author.find(params[:id])
    @post = Post.find(params[:post_id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ?  [["author_id", 4]]